# Third-party repositories (fonts and versions are now in core)
tap "buo/cask-upgrade"

# System utilities
brew "coreutils"
brew "gnu-sed"
brew "htop"
brew "watch"

# Development tools
brew "git"
brew "git-delta"
brew "gh"
brew "go"
brew "gnupg"
brew "openssl@3"
brew "readline"

# File and data processing
brew "dust"
brew "eza"
brew "ffmpeg"
brew "fx"
brew "fzf"
brew "imagemagick"
brew "jq"
brew "p7zip"
brew "pigz"
brew "xsv"
brew "yq"

# Java development
brew "jenv"
brew "maven"

# JavaScript/Node development
brew "nvm"
brew "yarn"

# Python development
brew "pipenv"
brew "poetry"
brew "pyenv"

# Container and infrastructure
brew "colima"
brew "docker"
brew "c-bata/kube-prompt/kube-prompt"
brew "rs/tap/dnstrace"

# Databases
brew "postgresql"
brew "redis"

# macOS utilities
brew "mas"
brew "pinentry-mac"

# Documentation and planning
brew "plantuml"

# AI Development Tools
brew "ollama"

# Development IDEs and tools
cask "intellij-idea"
cask "visual-studio-code"
cask "datagrip"
cask "postman"
cask "claude-code"

# Terminal and shell
cask "hyper"

# Java runtimes
cask "temurin@11"
cask "temurin@17"
cask "temurin@21"

# Productivity and note-taking
cask "obsidian"
cask "logseq"
cask "todoist-app"

# System utilities and enhancements
cask "clipy"
cask "amethyst"
cask "aerial"

# Fonts to install
cask "font-3270-nerd-font"
#cask "font-fira-mono-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-monofur-nerd-font"
cask "font-overpass-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-agave-nerd-font"
cask "font-arimo-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-m+-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"
